# BASIC SQL IMPORTS

In [1]:
%load_ext sql

In [2]:
import csv , sqlite3
con = sqlite3.connect("SelectQuery.db")
cur = con.cursor()

In [3]:
%sql sqlite:///SelectQuery.db

# import the csv file with pandas first

In [4]:
import pandas as pd

from warnings import filterwarnings
filterwarnings("ignore")

In [5]:
df  = pd.read_csv(r"C:\Users\Pranit\OneDrive\Desktop\AI\Sql\lec 3\EmployeeData.csv")

In [6]:
df

   empid    fname    lname    sal  did
0    101  Utkarsh  Gaikwad  20000   10
1    102  Sarthak   Sharma  25000   20
2    103    Raman    Verma  35000   30
3    104   Rakesh     Jain  40000   20
4    105    Aditi     Naik  37000   20
5    106   Suresh     More  36000   10
6    107   Sayali     Kale  40000   30
7    108  Narayan     More  45000   30
8    109     Atif     Khan  34000   10
9    110   Ramesh     Gaud  26000   10

# Import the dataframe to sql

In [7]:
df.to_sql("Employees",con,if_exists="replace",index=False)

10

# Seeing the Entire data with select query

In [8]:
%%sql
SELECT * FROM Employees;

 * sqlite:///SelectQuery.db
Done.

[(101, 'Utkarsh', 'Gaikwad', 20000, 10),
 (102, 'Sarthak', 'Sharma', 25000, 20),
 (103, 'Raman', 'Verma', 35000, 30),
 (104, 'Rakesh', 'Jain', 40000, 20),
 (105, 'Aditi', 'Naik', 37000, 20),
 (106, 'Suresh', 'More', 36000, 10),
 (107, 'Sayali', 'Kale', 40000, 30),
 (108, 'Narayan', 'More', 45000, 30),
 (109, 'Atif', 'Khan', 34000, 10),
 (110, 'Ramesh', 'Gaud', 26000, 10)]

# Select Specific Columns from the data

In [9]:
%%sql
SELECT fname,lname FROM Employees;

 * sqlite:///SelectQuery.db
Done.

[('Utkarsh', 'Gaikwad'),
 ('Sarthak', 'Sharma'),
 ('Raman', 'Verma'),
 ('Rakesh', 'Jain'),
 ('Aditi', 'Naik'),
 ('Suresh', 'More'),
 ('Sayali', 'Kale'),
 ('Narayan', 'More'),
 ('Atif', 'Khan'),
 ('Ramesh', 'Gaud')]

In [10]:
%%sql
SELECT sal , did FROM Employees;

 * sqlite:///SelectQuery.db
Done.

[(20000, 10),
 (25000, 20),
 (35000, 30),
 (40000, 20),
 (37000, 20),
 (36000, 10),
 (40000, 30),
 (45000, 30),
 (34000, 10),
 (26000, 10)]

# WHERE Clause

### Find out employees who's salary is greater than or equal to 35000

In [11]:
%%sql
SELECT * FROM Employees
WHERE sal>=35000;

 * sqlite:///SelectQuery.db
Done.

[(103, 'Raman', 'Verma', 35000, 30),
 (104, 'Rakesh', 'Jain', 40000, 20),
 (105, 'Aditi', 'Naik', 37000, 20),
 (106, 'Suresh', 'More', 36000, 10),
 (107, 'Sayali', 'Kale', 40000, 30),
 (108, 'Narayan', 'More', 45000, 30)]

### Find out employee name who are in did 20

In [12]:
%%sql
SELECT empid,did FROM Employees
WHERE did = 20;

 * sqlite:///SelectQuery.db
Done.

[(102, 20), (104, 20), (105, 20)]

In [13]:
%%sql
SELECT empid,fname,lname,did FROM Employees
WHERE did = 20;

 * sqlite:///SelectQuery.db
Done.

[(102, 'Sarthak', 'Sharma', 20),
 (104, 'Rakesh', 'Jain', 20),
 (105, 'Aditi', 'Naik', 20)]

### Find out employee first names starting from S

In [14]:
%%sql
SELECT * FROM Employees
WHERE fname LIKE "S%"

 * sqlite:///SelectQuery.db
Done.

[(102, 'Sarthak', 'Sharma', 25000, 20),
 (106, 'Suresh', 'More', 36000, 10),
 (107, 'Sayali', 'Kale', 40000, 30)]

### Find employees who's last name ends with e

In [15]:
%%sql
SELECT * FROM Employees
WHERE lname LIKE "%E"

 * sqlite:///SelectQuery.db
Done.

[(106, 'Suresh', 'More', 36000, 10),
 (107, 'Sayali', 'Kale', 40000, 30),
 (108, 'Narayan', 'More', 45000, 30)]

# Aggreagation Function - AVG, SUM and COUNT

### Find out total salary

In [16]:
%%sql
SELECT SUM(sal) FROM Employees;

 * sqlite:///SelectQuery.db
Done.

[(338000,)]

### Find out average Salary

In [17]:
%%sql
SELECT AVG(sal) FROM Employees;

 * sqlite:///SelectQuery.db
Done.

[(33800.0,)]

### Find out empoyee count where sal < 30000

In [18]:
%%sql
SELECT COUNT(empid) FROM Employees
WHERE sal<30000;

 * sqlite:///SelectQuery.db
Done.

[(3,)]

In [19]:
%%sql
SELECT * FROM employees

 * sqlite:///SelectQuery.db
Done.

[(101, 'Utkarsh', 'Gaikwad', 20000, 10),
 (102, 'Sarthak', 'Sharma', 25000, 20),
 (103, 'Raman', 'Verma', 35000, 30),
 (104, 'Rakesh', 'Jain', 40000, 20),
 (105, 'Aditi', 'Naik', 37000, 20),
 (106, 'Suresh', 'More', 36000, 10),
 (107, 'Sayali', 'Kale', 40000, 30),
 (108, 'Narayan', 'More', 45000, 30),
 (109, 'Atif', 'Khan', 34000, 10),
 (110, 'Ramesh', 'Gaud', 26000, 10)]

### Unique values counting

In [20]:
%%sql
SELECT DISTINCT did FROM Employees;

 * sqlite:///SelectQuery.db
Done.

[(10,), (20,), (30,)]

In [21]:
%%sql
SELECT COUNT(DISTINCT did) FROM Employees;

 * sqlite:///SelectQuery.db
Done.

[(3,)]

In [22]:
%%sql
SELECT * FROM Employees;

 * sqlite:///SelectQuery.db
Done.

[(101, 'Utkarsh', 'Gaikwad', 20000, 10),
 (102, 'Sarthak', 'Sharma', 25000, 20),
 (103, 'Raman', 'Verma', 35000, 30),
 (104, 'Rakesh', 'Jain', 40000, 20),
 (105, 'Aditi', 'Naik', 37000, 20),
 (106, 'Suresh', 'More', 36000, 10),
 (107, 'Sayali', 'Kale', 40000, 30),
 (108, 'Narayan', 'More', 45000, 30),
 (109, 'Atif', 'Khan', 34000, 10),
 (110, 'Ramesh', 'Gaud', 26000, 10)]

### Find Employees whose salary is less than Average Salary

In [23]:
%%sql
SELECT AVG(sal) FROM Employees;

 * sqlite:///SelectQuery.db
Done.

[(33800.0,)]

In [24]:
%%sql
SELECT * FROM Employees
WHERE sal < (SELECT AVG(sal) FROM Employees);

 * sqlite:///SelectQuery.db
Done.

[(101, 'Utkarsh', 'Gaikwad', 20000, 10),
 (102, 'Sarthak', 'Sharma', 25000, 20),
 (110, 'Ramesh', 'Gaud', 26000, 10)]

# Order by clause

### Sort the employees on basis of Salary in Descending Order

In [25]:
%%sql
SELECT * FROM Employees
ORDER BY sal DESC;

 * sqlite:///SelectQuery.db
Done.

[(108, 'Narayan', 'More', 45000, 30),
 (104, 'Rakesh', 'Jain', 40000, 20),
 (107, 'Sayali', 'Kale', 40000, 30),
 (105, 'Aditi', 'Naik', 37000, 20),
 (106, 'Suresh', 'More', 36000, 10),
 (103, 'Raman', 'Verma', 35000, 30),
 (109, 'Atif', 'Khan', 34000, 10),
 (110, 'Ramesh', 'Gaud', 26000, 10),
 (102, 'Sarthak', 'Sharma', 25000, 20),
 (101, 'Utkarsh', 'Gaikwad', 20000, 10)]

### Show me names and salary of top3 highest saliried employees

In [26]:
%%sql
SELECT * FROM Employees
ORDER BY sal DESC
LIMIT 3;

 * sqlite:///SelectQuery.db
Done.

[(108, 'Narayan', 'More', 45000, 30),
 (104, 'Rakesh', 'Jain', 40000, 20),
 (107, 'Sayali', 'Kale', 40000, 30)]

# Group By Clause

### Find out average salary based on department id

In [27]:
%%sql
SELECT did , AVG(sal) FROM Employees
GROUP BY did;

 * sqlite:///SelectQuery.db
Done.

[(10, 29000.0), (20, 34000.0), (30, 40000.0)]

In [28]:
%%sql
SELECT did, AVG(sal) FROM Employees
GROUP BY did
ORDER BY AVG(sal) DESC;

 * sqlite:///SelectQuery.db
Done.

[(30, 40000.0), (20, 34000.0), (10, 29000.0)]